INSERT INTO regions (id, description)
VALUES (1, 'Вінницька область');

INSERT INTO cities (description, region_id)
VALUES ('Вінниця', 1),
       ('Бар', 1),
       ('Бершадь', 1),
       ('Гайсин', 1),
       ('Жмеринка', 1),
       ('Козятин', 1),
       ('Ладижин', 1),
       ('Могилів-Подільський', 1),
       ('Немирів', 1),
       ('Погребище', 1),
       ('Тульчин', 1),
       ('Умань', 1),
       ('Хмільник', 1);


INSERT INTO regions (id, description)
VALUES (2, 'Волинська область');

INSERT INTO cities (description, region_id)
VALUES ('Луцьк', 2),
       ('Володимир', 2),
       ('Ковель', 2),
       ('Нововолинськ', 2),
       ('Берестечко', 2),
       ('Горохів', 2),
       ('Камінь-Каширський', 2),
       ('Ківерці', 2),
       ('Любомль', 2),
       ('Рожище', 2),
       ('Устилуг', 2);


INSERT INTO regions (id, description)
VALUES (3, 'Дніпропетровська область');

INSERT INTO cities (description, region_id)
VALUES ('Дніпро', 3),
       ('Вільногірськ', 3),
       ('Жовті Води', 3),
       ('Камянське', 3),
       ('Кривий Ріг', 3),
       ('Марганець', 3),
       ('Нікополь', 3),
       ('Новомосковськ', 3),
       ('Павлоград', 3),
       ('Першотравенськ', 3),
       ('Покров', 3),
       ('Синельникове', 3),
       ('Тернівка', 3),
       ('Апостолове', 3),
       ('Верхівцеве', 3),
       ('Верхньодніпровськ', 3),
       ('Зеленодольськ', 3),
       ('Перещепине', 3),
       ('Підгородне', 3),
       ('Пятихатки', 3);


INSERT INTO regions (id, description)
VALUES (4, 'Донецька область');

INSERT INTO cities (description, region_id)
VALUES ('Авдіївка', 4),
       ('Бахмут', 4),
       ('Вугледар', 4),
       ('Горлівка', 4),
       ('Дебальцеве', 4),
       ('Добропілля', 4),
       ('Докучаєвськ', 4),
       ('Донецьк', 4),
       ('Дружківка', 4),
       ('Єнакієве', 4),
       ('Жданівка', 4),
       ('Костянтинівка', 4),
       ('Краматорськ', 4),
       ('Лиман', 4),
       ('Макіївка', 4),
       ('Маріуполь', 4),
       ('Мирноград', 4),
       ('Новогродівка', 4),
       ('Покровськ', 4),
       ('Селидове', 4),
       ('Словянськ', 4),
       ('Сніжне', 4),
       ('Торецьк', 4),
       ('Харцизьк', 4),
       ('Хрестівка', 4),
       ('Чистякове', 4),
       ('Шахтарськ', 4),
       ('Ясинувата', 4),
       ('Амвросіївка', 4),
       ('Артемівськ', 4),
       ('Білицьке', 4),
       ('Вуглегірськ', 4),
       ('Часів Яр', 4),
       ('Світлодарськ', 4),
       ('Соледар', 4),
       ('Білозерське', 4),
       ('Сіверськ', 4),
       ('Марїнка', 4),
       ('Курахове', 4),
       ('Святогірськ', 4),
       ('Зугрес', 4);


INSERT INTO regions (id, description)
VALUES (5, 'Житомирська область');
INSERT INTO cities (description, region_id)
VALUES ('Житомир', 5),
       ('Бердичів', 5),
       ('Коростень', 5),
       ('Новоград-Волинський', 5),
       ('Андрушівка', 5),
       ('Коростишів', 5),
       ('Малин', 5),
       ('Овруч', 5),
       ('Радомишль', 5),
       ('Чуднів', 5);



INSERT INTO regions (id, description)
VALUES (6, 'Закарпатська область');

INSERT INTO cities (description, region_id)
VALUES ('Ужгород', 6),
       ('Мукачево', 6),
       ('Хуст', 6),
       ('Берегове', 6),
       ('Чоп', 6),
       ('Виноградів', 6),
       ('Іршава', 6),
       ('Перечин', 6),
       ('Рахів', 6),
       ('Свалява', 6),
       ('Тячів', 6);


INSERT INTO regions (id, description)
VALUES (7, 'Запорізька область');

INSERT INTO cities (description, region_id)
VALUES ('Запоріжжя', 7),
       ('Бердянськ', 7),
       ('Енергодар', 7),
       ('Мелітополь', 7),
       ('Токмак', 7),
       ('Камянка-Дніпровська', 7),
       ('Молочанськ', 7),
       ('Оріхів', 7),
       ('Пологи', 7),
       ('Приморськ', 7),
       ('Василівка', 7),
       ('Вільнянськ', 7),
       ('Гуляйполе', 7);


INSERT INTO regions (id, description)
VALUES (8, 'Івано-Франківська область');

INSERT INTO cities (description, region_id)
VALUES ('Івано-Франківськ', 8),
       ('Калуш', 8),
       ('Коломия', 8),
       ('Яремче', 8),
       ('Болехів', 8),
       ('Бурштин', 8),
       ('Долина', 8),
       ('Городенка', 8),
       ('Надвірна', 8),
       ('Рожнятів', 8),
       ('Снятин', 8),
       ('Тлумач', 8),
       ('Тисмениця', 8),
       ('Галич', 8),
       ('Городок', 8);


INSERT INTO regions (id, description)
VALUES (9, 'Київська область');

INSERT INTO cities (description, region_id)
VALUES ('Київ', 9),
       ('Біла Церква', 9),
       ('Бориспіль', 9),
       ('Бровари', 9),
       ('Вишневе', 9),
       ('Боярка', 9),
       ('Ірпінь', 9),
       ('Фастів', 9),
       ('Обухів', 9),
       ('Переяслав', 9),
       ('Ржищів', 9),
       ('Українка', 9),
       ('Кагарлик', 9),
       ('Богуслав', 9),
       ('Узин', 9),
       ('Тараща', 9),
       ('Сквира', 9),
       ('Яготин', 9),
       ('Вишгород', 9),
       ('Васильків', 9),
       ('Згурівка', 9),
       ('Ставище', 9),
       ('Макарів', 9),
       ('Баришівка', 9);


INSERT INTO regions (id, description)
VALUES (10, 'Кіровоградська область');

INSERT INTO cities (description, region_id)
VALUES ('Кропивницький', 10),
       ('Олександрія', 10),
       ('Знам''янка', 10),
       ('Світловодськ', 10),
       ('Новоукраїнка', 10),
       ('Гайворон', 10),
       ('Долинська', 10),
       ('Помічна', 10),
       ('Мала Виска', 10),
       ('Благовіщенське', 10),
       ('Бобринець', 10);


INSERT INTO regions (id, description)
VALUES (11, 'Луганська область');

INSERT INTO cities (description, region_id)
VALUES ('Луганськ', 11),
       ('Алчевськ', 11),
       ('Антрацит', 11),
       ('Хрустальний', 11),
       ('Первомайськ', 11),
       ('Брянка', 11),
       ('Рубіжне', 11),
       ('Сєвєродонецьк', 11),
       ('Ровеньки', 11),
       ('Сорокине', 11),
       ('Кадіївка', 11),
       ('Лисичанськ', 11),
       ('Голубівка', 11),
       ('Довжанськ', 11);


INSERT INTO regions (id, description)
VALUES (12, 'Львівська область');

INSERT INTO cities (description, region_id)
VALUES ('Львів', 12),
       ('Дрогобич', 12),
       ('Стрий', 12),
       ('Червоноград', 12),
       ('Самбір', 12),
       ('Трускавець', 12),
       ('Борислав', 12),
       ('Новий Розділ', 12),
       ('Моршин', 12),
       ('Золочів', 12),
       ('Броди', 12),
       ('Сокаль', 12),
       ('Стебник', 12),
       ('Винники', 12),
       ('Городок', 12),
       ('Миколаїв', 12),
       ('Жовква', 12),
       ('Яворів', 12),
       ('Соснівка', 12),
       ('Жидачів', 12),
       ('Камянка-Бузька', 12),
       ('Дубляни', 12),
       ('Радехів', 12),
       ('Пустомити', 12),
       ('Мостиська', 12),
       ('Ходорів', 12),
       ('Буськ', 12),
       ('Рава-Руська', 12),
       ('Турка', 12),
       ('Перемишляни', 12),
       ('Старий Самбір', 12),
       ('Судова Вишня', 12),
       ('Великі Мости', 12),
       ('Сколе', 12),
       ('Рудки', 12),
       ('Новий Калинів', 12),
       ('Добромиль', 12),
       ('Хирів', 12),
       ('Бібрка', 12),
       ('Комарно', 12),
       ('Глиняни', 12),
       ('Белз', 12),
       ('Угнів', 12);


INSERT INTO regions (id, description)
VALUES (13, 'Миколаївська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Миколаїв', 13),
    ('Вознесенськ', 13),
    ('Очаків', 13),
    ('Первомайськ', 13),
    ('Южноукраїнськ', 13),
    ('Баштанка', 13),
    ('Нова Одеса', 13),
    ('Новий Буг', 13),
    ('Криве Озеро', 13),
    ('Снігурівка', 13);


INSERT INTO regions (id, description)
VALUES (14, 'Одеська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Одеса', 14),
    ('Білгород-Дністровський', 14),
    ('Біляївка', 14),
    ('Ізмаїл', 14),
    ('Подільськ', 14),
    ('Теплодар', 14),
    ('Чорноморськ', 14),
    ('Южне', 14),
    ('Ананьїв', 14),
    ('Арциз', 14),
    ('Березівка', 14),
    ('Болград', 14),
    ('Вилкове', 14),
    ('Кілія', 14),
    ('Кодима', 14),
    ('Рені', 14),
    ('Роздільна', 14),
    ('Татарбунари', 14);


INSERT INTO regions (id, description)
VALUES (15, 'Полтавська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Полтава', 15),
    ('Горішні Плавні', 15),
    ('Кременчук', 15),
    ('Лубни', 15),
    ('Миргород', 15),
    ('Гадяч', 15),
    ('Зіньків', 15),
    ('Кобеляки', 15),
    ('Лохвиця', 15),
    ('Оржиця', 15),
    ('Пирятин', 15),
    ('Карлівка', 15),
    ('Решетилівка', 15),
    ('Хороль', 15);


INSERT INTO regions (id, description)
VALUES (16, 'Рівненська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Рівне', 16),
    ('Дубно', 16),
    ('Сарни', 16),
    ('Корець', 16),
    ('Костопіль', 16),
    ('Березне', 16),
    ('Здолбунів', 16),
    ('Радивилів', 16),
    ('Дубровиця', 16),
    ('Клевань', 16);


INSERT INTO regions (id, description)
VALUES (17, 'Сумська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Суми', 17),
    ('Конотоп', 17),
    ('Шостка', 17),
    ('Охтирка', 17),
    ('Ромни', 17),
    ('Білопілля', 17),
    ('Буринь', 17),
    ('Ворожба', 17),
    ('Дружба', 17),
    ('Кролевець', 17),
    ('Середина-Буда', 17),
    ('Тростянець', 17),
    ('Лебедин', 17);


INSERT INTO regions (id, description)
VALUES (18, 'Тернопільська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Тернопіль', 18),
    ('Бережани', 18),
    ('Бучач', 18),
    ('Чортків', 18),
    ('Кременець', 18),
    ('Шумськ', 18),
    ('Заліщики', 18),
    ('Збараж', 18),
    ('Зборів', 18),
    ('Копичинці', 18),
    ('Ланівці', 18),
    ('Монастириська', 18),
    ('Підгайці', 18),
    ('Почаїв', 18),
    ('Скалат', 18);


INSERT INTO regions (id, description)
VALUES (19, 'Харківська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Харків', 19),
    ('Ізюм', 19),
    ('Чугуїв', 19),
    ('Люботин', 19),
    ('Первомайський', 19),
    ('Куп''янськ', 19),
    ('Лозова', 19),
    ('Красноград', 19),
    ('Мерефа', 19),
    ('Південне', 19),
    ('Балаклія', 19),
    ('Барвінкове', 19),
    ('Богодухів', 19),
    ('Валки', 19),
    ('Вовчанськ', 19),
    ('Дергачі', 19),
    ('Зміїв', 19);


INSERT INTO regions (id, description)
VALUES (20, 'Херсонська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Херсон', 20),
    ('Берислав', 20),
    ('Скадовськ', 20),
    ('Олешки', 20),
    ('Нова Каховка', 20),
    ('Генічеськ', 20),
    ('Каховка', 20),
    ('Таврійськ', 20),
    ('Гола Пристань', 20);