INSERT INTO regions (id, description)
VALUES (21, 'Хмельницька область');

INSERT INTO cities (description, region_id)
VALUES
    ('Хмельницький', 21),
    ('Камянець-Подільський', 21),
  ('Нетішин', 21),
  ('Славута', 21),
  ('Старокостянтинів', 21),
  ('Ізяслав', 21),
  ('Шепетівка', 21),
  ('Городок', 21),
  ('Деражня', 21),
  ('Дунаївці', 21),
  ('Полонне', 21),
  ('Красилів', 21);


INSERT INTO regions (id, description)
VALUES (22, 'Черкаська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Черкаси', 22),
    ('Ватутіне', 22),
    ('Золотоноша', 22),
    ('Канів', 22),
    ('Сміла', 22),
    ('Умань', 22),
    ('Городище', 22),
    ('Жашків', 22),
    ('Монастирище', 22),
    ('Тальне', 22),
    ('Христинівка', 22),
    ('Чигирин', 22),
    ('Шпола', 22);


INSERT INTO regions (id, description)
VALUES (23, 'Чернівецька область');

INSERT INTO cities (description, region_id)
VALUES
    ('Чернівці', 23),
    ('Новодністровськ', 23),
    ('Вашківці', 23),
    ('Вижниця', 23),
    ('Герца', 23),
    ('Кіцмань', 23),
    ('Сокиряни', 23),
    ('Сторожинець', 23),
    ('Хотин', 23);


INSERT INTO regions (id, description)
VALUES (24, 'Чернігівська область');

INSERT INTO cities (description, region_id)
VALUES
    ('Чернігів', 24),
    ('Ніжин', 24),
    ('Прилуки', 24),
    ('Бахмач', 24),
    ('Городня', 24),
    ('Ічня', 24),
    ('Борзна', 24),
    ('Мена', 24),
    ('Остер', 24),
    ('Семенівка', 24),
    ('Сновськ', 24),
    ('Козелець', 24),
    ('Дмитрівка', 24),
    ('Радуль', 24);

INSERT INTO regions (id, description)
VALUES (25, 'АР Крим');

INSERT INTO cities (description, region_id)
VALUES
    ('Сімферополь', 25),
    ('Севастополь', 25),
    ('Алупка', 25),
    ('Алушта', 25),
    ('Армянськ', 25),
    ('Бахчисарай', 25),
    ('Білогірськ', 25),
    ('Джанкой', 25),
    ('Євпаторія', 25),
    ('Керч', 25),
    ('Красноперекопськ', 25),
    ('Саки', 25),
    ('Судак', 25),
    ('Феодосія', 25),
    ('Щолкіне', 25),
    ('Ялта', 25);