DELETE
FROM "uAutoTest".public.regions;

DELETE
FROM "uAutoTest".public.cities;

INSERT INTO "uAutoTest".public.regions (description)
VALUES ('Вінницька область'),
       ('Волинська область'),
       ('Дніпропетровська область'),
       ('Донецька область'),
       ('Житомирська область'),
       ('Закарпатська область'),
       ('Запорізька область'),
       ('Івано-Франківська область'),
       ('Київська область'),
       ('Кіровоградська область'),
       ('Луганська область'),
       ('Львівська область'),
       ('Миколаївська область'),
       ('Одеська область'),
       ('Полтавська область'),
       ('Рівненська область'),
       ('Сумська область'),
       ('Тернопільська область'),
       ('Харківська область'),
       ('Херсонська область'),
       ('Хмельницька область'),
       ('Черкаська область'),
       ('Чернівецька область'),
       ('Чернігівська область');

INSERT INTO "uAutoTest".public.cities (description, region_id)
VALUES ('Вінниця', 1),
       ('Луцьк', 2),
       ('Дніпро', 3),
       ('Донецьк', 4),
       ('Житомир', 5),
       ('Ужгород', 6),
       ('Запоріжжя', 7),
       ('Івано-Франківськ', 8),
       ('Київ', 9),
       ('Кропивницький', 10),
       ('Луганськ', 11),
       ('Львів', 12),
       ('Миколаїв', 13),
       ('Одеса', 14),
       ('Полтава', 15),
       ('Рівне', 16),
       ('Суми', 17),
       ('Тернопіль', 18),
       ('Харків', 19),
       ('Херсон', 20),
       ('Хмельницький', 21),
       ('Черкаси', 22),
       ('Чернівці', 23),
       ('Чернігів', 24);